[Killed] Logical mutation
us/fatehi/Palindrome/Palindrome.cs:9:17
         {
             // Exit early for trivial cases, such as null,
             // empty string, and a word with a single letter
-            if (word == null || word.Length < 2)
+            if (word == null && word.Length < 2)
             {
                 return true;
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionHappy; us.fatehi.palindrome.test.PalindromeTests.EdgeCaseEmptyString; us.fatehi.palindrome.test.PalindromeTests.EdgeCaseNull

[Killed] Negate expression
us/fatehi/Palindrome/Palindrome.cs:9:17
         {
             // Exit early for trivial cases, such as null,
             // empty string, and a word with a single letter
-            if (word == null || word.Length < 2)
+            if (!(word == null || word.Length < 2))
             {
                 return true;
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.MorePalindromeTest.AlmostPalindrome; us.fatehi.palindrome.test.PalindromeTests.EdgeCaseEmptyString

[Timeout] Arithmetic mutation
us/fatehi/Palindrome/Palindrome.cs:15:34
             }
 
             char firstChar = word[0];
-            char lastChar = word[word.Length - 1];
+            char lastChar = word[word.Length + 1];
             string center = word.Substring(1, word.Length - 2);
             return (firstChar == lastChar) && IsPalindrome(center);

[Killed] Arithmetic mutation
us/fatehi/Palindrome/Palindrome.cs:16:47
 
             char firstChar = word[0];
             char lastChar = word[word.Length - 1];
-            string center = word.Substring(1, word.Length - 2);
+            string center = word.Substring(1, word.Length + 2);
             return (firstChar == lastChar) && IsPalindrome(center);
         }
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionHappy; us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.MorePalindromeTest.AlmostPalindrome

[Killed] Equality mutation
us/fatehi/Palindrome/Palindrome.cs:17:21
             char firstChar = word[0];
             char lastChar = word[word.Length - 1];
             string center = word.Substring(1, word.Length - 2);
-            return (firstChar == lastChar) && IsPalindrome(center);
+            return (firstChar != lastChar) && IsPalindrome(center);
         }
     }
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionHappy; us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.PalindromeTests.HappyPathEvenLetters

[Killed] Logical mutation
us/fatehi/Palindrome/Palindrome.cs:17:20
             char firstChar = word[0];
             char lastChar = word[word.Length - 1];
             string center = word.Substring(1, word.Length - 2);
-            return (firstChar == lastChar) && IsPalindrome(center);
+            return (firstChar == lastChar) || IsPalindrome(center);
         }
     }
killedBy: us.fatehi.palindrome.test.BetterPalindromeTest.BoundaryConditionNegative; us.fatehi.palindrome.test.MorePalindromeTest.AlmostPalindrome; us.fatehi.palindrome.test.PalindromeTests.NegativeCase
